import pandas as pd
import pytest


@pytest.fixture
def transactions_for_test():
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -160.9,
            "Кэшбэк": 70,
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
        },
        {
            "Дата операции": "29.12.2021 22:28:47",
            "Дата платежа": "29.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -1411.4,
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
        },
        {
            "Дата операции": "28.12.2021 18:42:21",
            "Дата платежа": "28.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -257.9,
            "Кэшбэк": 20,
            "Категория": "Каршеринг",
            "Описание": "Ситидрайв",
        },
        {
            "Дата операции": "23.12.2021 16:14:59",
            "Дата платежа": "23.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -2000,
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "Описание": "Дмитрий Ш.",
        },
    ]


@pytest.fixture
def transactions_for_test_without_phone_num():
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -160.89,
            "Кэшбэк": 70,
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
        },
        {
            "Дата операции": "28.12.2021 18:42:21",
            "Дата платежа": "28.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -257.89,
            "Кэшбэк": 20,
            "Категория": "Каршеринг",
            "Описание": "Ситидрайв",
        },
        {
            "Дата операции": "23.12.2021 16:14:59",
            "Дата платежа": "23.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -2000,
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "Описание": "Дмитрий Ш.",
        },
    ]


@pytest.fixture
def transactions_for_test_without_transfers_to_ind():
    return [
        {
            "Дата операции": "31.12.2021",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -160.89,
            "Сумма операции с округлением": 160.89,
            "Кэшбэк": 70,
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
        },
        {
            "Дата операции": "28.12.2021",
            "Дата платежа": "28.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -257.89,
            "Сумма операции с округлением": 257.89,
            "Кэшбэк": 20,
            "Категория": "Каршеринг",
            "Описание": "Ситидрайв",
        },
    ]


@pytest.fixture
def transactions_for_test_filter_by_month():
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -160.9,
            "Кэшбэк": 70,
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
        },
        {
            "Дата операции": "29.12.2021 22:28:47",
            "Дата платежа": "29.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -1411.4,
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
        },
        {
            "Дата операции": "28.11.2021 18:42:21",
            "Дата платежа": "28.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -257.9,
            "Кэшбэк": 20,
            "Категория": "Каршеринг",
            "Описание": "Ситидрайв",
        },
        {
            "Дата операции": "23.11.2021 16:14:59",
            "Дата платежа": "23.12.2021",
            "Номер карты": "*7197",
            "Сумма операции": -2000,
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "Описание": "Дмитрий Ш.",
        },
    ]


@pytest.fixture()
def transactions_data_frame() -> pd.DataFrame:
    transactions_data = [
        {
            "Дата операции": "20.09.2021 12:45:12",
            "Дата платежа": "20.09.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 200.00,
        },
        {
            "Дата операции": "15.11.2021 01:02:03",
            "Дата платежа": "15.11.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 150.00,
        },
        {
            "Дата операции": "10.12.2021 12:12:12",
            "Дата платежа": "10.12.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 100.00,
        },
    ]
    transactions_df = pd.DataFrame(transactions_data)
    return transactions_df
